; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v7 - type_3 ?v3 - type_2)
 	      (pred_1 ?v6 - object ?v3 - type_2)
	      (pred_3 ?v7 - type_3 ?v4 - type_1)
	      (pred_2 ?v7 - type_3 ?v6 - object ?v4 - type_1))

   (:action op_2
       :parameters  (?v7 - type_3 ?v1 ?v5 - type_2)
       :precondition (and  (pred_4 ?v7 ?v1))
       :effect (and  (pred_4 ?v7 ?v5)
		     (not (pred_4 ?v7 ?v1))))

   (:action op_3
       :parameters (?v7 - type_3 ?v8 - object ?v2 - type_2 ?v4 - type_1)
       :precondition  (and  (pred_1 ?v8 ?v2) (pred_4 ?v7 ?v2) (pred_3 ?v7 ?v4))
       :effect (and (pred_2 ?v7 ?v8 ?v4)
		    (not (pred_1 ?v8 ?v2)) 
		    (not (pred_3 ?v7 ?v4))))

   (:action op_1
       :parameters (?v7 - type_3 ?v8 - object ?v2 - type_2 ?v4 - type_1)
       :precondition  (and  (pred_2 ?v7 ?v8 ?v4) (pred_4 ?v7 ?v2))
       :effect (and (pred_1 ?v8 ?v2)
		    (pred_3 ?v7 ?v4)
		    (not (pred_2 ?v7 ?v8 ?v4)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_09 obj_13 - type_3
obj_10 obj_01 obj_12 obj_03 - type_1
obj_11 obj_06 obj_04 obj_02 - type_2
obj_08 obj_05 obj_07 - object)
(:init
(pred_4 obj_09 obj_02)
(pred_3 obj_09 obj_10)
(pred_3 obj_09 obj_01)
(pred_4 obj_13 obj_02)
(pred_3 obj_13 obj_12)
(pred_3 obj_13 obj_03)
(pred_1 obj_08 obj_04)
(pred_1 obj_05 obj_11)
(pred_1 obj_07 obj_04)
)
(:goal
(and
(pred_1 obj_08 obj_02)
(pred_1 obj_05 obj_04)
(pred_1 obj_07 obj_11)
)
)

(:constraints
  (always (not (pred_4 obj_09 obj_04)))
)
)

; plan
1. (op_2 obj_13 obj_02 obj_11)
   deleted: (pred_4 obj_13 obj_02)
   added: (pred_4 obj_13 obj_11)
   goals met: 0 of 3
2. (op_3 obj_13 obj_05 obj_11 obj_03)
   deleted: (pred_1 obj_05 obj_11) (pred_3 obj_13 obj_03)
   added: (pred_2 obj_13 obj_05 obj_03)
   goals met: 0 of 3
3. (op_2 obj_13 obj_11 obj_04)
   deleted: (pred_4 obj_13 obj_11)
   added: (pred_4 obj_13 obj_04)
   goals met: 0 of 3
4. (op_1 obj_13 obj_05 obj_04 obj_03)
   deleted: (pred_2 obj_13 obj_05 obj_03)
   added: (pred_1 obj_05 obj_04) (pred_3 obj_13 obj_03)
   goals met: 1 of 3
5. (op_3 obj_13 obj_07 obj_04 obj_03)
   deleted: (pred_1 obj_07 obj_04) (pred_3 obj_13 obj_03)
   added: (pred_2 obj_13 obj_07 obj_03)
   goals met: 1 of 3
6. (op_2 obj_13 obj_04 obj_11)
   deleted: (pred_4 obj_13 obj_04)
   added: (pred_4 obj_13 obj_11)
   goals met: 1 of 3
7. (op_1 obj_13 obj_07 obj_11 obj_03)
   deleted: (pred_2 obj_13 obj_07 obj_03)
   added: (pred_1 obj_07 obj_11) (pred_3 obj_13 obj_03)
   goals met: 2 of 3
8. (op_2 obj_13 obj_11 obj_04)
   deleted: (pred_4 obj_13 obj_11)
   added: (pred_4 obj_13 obj_04)
   goals met: 2 of 3
9. (op_3 obj_13 obj_08 obj_04 obj_03)
   deleted: (pred_1 obj_08 obj_04) (pred_3 obj_13 obj_03)
   added: (pred_2 obj_13 obj_08 obj_03)
   goals met: 2 of 3
10. (op_2 obj_13 obj_04 obj_02)
   deleted: (pred_4 obj_13 obj_04)
   added: (pred_4 obj_13 obj_02)
   goals met: 2 of 3
11. (op_1 obj_13 obj_08 obj_02 obj_03)
   deleted: (pred_2 obj_13 obj_08 obj_03)
   added: (pred_1 obj_08 obj_02) (pred_3 obj_13 obj_03)
   goals met: 3 of 3
